export function computerNetworksView(): string {
  return `
        <section id="compt-network">
      <div class="hero-section">
        <div class="image-wrapper">
          <img
            src="./assets/comp_net_work.jpg"
            alt="comp_net"
            class="cn-bg-image"
          />
        </div>
        <div class="cn-overlay-text">
          <h2 class="cn-title">Компютърни мрежи <br /></h2>
          <h3 class="cn-subtitle">
            Изграждането на компютърна мрежа не е просто свързване на кабели и
            устройства – това е основата, върху която ще стъпва работата на
            вашия екип всеки ден. За да можем да предложим най-доброто решение
            за вашия бизнес, има няколко важни въпроса, които е добре да
            обмислите предварително:
          </h3>
        </div>
      </div>
      <div class="tips-grid">
        <div class="tip-card">
          <img
            src="./assets/bullet_icon.png"
            alt="Target Icon"
            class="tip-icon"
          />
          <p>
            Ще използвате мрежата основно за офис задачи, онлайн срещи и
            споделяне на файлове, или имате по-високи изисквания като сървъри,
            видеонаблюдение или специализиран софтуер? Колкото по-ясно знаем
            какво искате да постигнете, толкова по-прецизно ще изградим
            решението.
          </p>
        </div>

        <div class="tip-card">
          <img
            src="./assets/speed_icon.png"
            alt="Speed Icon"
            class="tip-icon"
          />
          <div class="image-wrapper">
            <img src="" alt="" />
          </div>
          <p>
            Достатъчна ли е стандартна скорост, или ви трябва високоскоростна
            инфраструктура за по-големи натоварвания? Предпочитате ли кабелна
            връзка за максимална стабилност, или удобството на Wi-Fi е
            приоритет? Сигурността също е ключова – можем да изградим защитени
            VPN връзки, отделни мрежи за гости и защитни системи срещу външни
            заплахи.
          </p>
        </div>

        <div class="tip-card">
          <img
            src="./assets/building_icon.png"
            alt="Office Building Icon"
            class="tip-icon"
          />
          <p>
            Брой помещения, етажи, работни места – всичко това влияе върху
            планирането на мрежата. Ако вече имате частично окабеляване, можем
            да го използваме, а ако започваме от нулата – ще предложим
            най-подходящото решение за вашето пространство.
          </p>
        </div>

        <div class="tip-card">
          <img
            src="./assets/money_icon.png"
            alt="Budget Icon"
            class="tip-icon"
          />
          <p>
            Можем да изградим базово, по-достъпно решение или да инвестирате в
            мрежа, която ще бъде устойчива и готова за разширяване години
            напред. Важното е решението да бъде в синхрон с вашите приоритети и
            визия за развитие.
          </p>
        </div>

        <div class="tip-card">
          <img
            src="./assets/working_tool_icon.png"
            alt="Maintenance Tools Icon"
            class="tip-icon"
          />
          <p>
            След изграждането идва моментът с грижата за системата. Ние
            предлагаме абонаментна поддръжка, за да сте спокойни, че мрежата ви
            винаги работи безотказно. Ако имате собствен IT човек, можем да
            съдействаме с документация и консултации.
          </p>
        </div>

        <div class="tip-card">
          <img
            src="./assets/book_icon.png"
            alt="Documentation Icon"
            class="tip-icon"
          />
          <p>
            Всяка мрежа може да бъде придружена със схема, инструкции и
            информация за конфигурациите. Това е полезно при бъдещи промени. Ако
            е необходимо, можем да обучим вашия екип за основни действия – като
            свързване към Wi-Fi или работа със защитен достъп.
          </p>
        </div>
      </div>
    </section>
    `;
}
